import time
import os


while True:
    print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢘⠛⠂⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠤⣤⠀⠀⠀⠀⠀⠀⠶⡄")
    print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⡀⠀⠀⠀⣼⣆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣆⠀⠀⠀⠀⠀⠀⣸⡄")
    print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣈⠙⠃⠀⣼⣿⣿⡆⠀⠀⠀⢀⣀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣾⣿⡆⠀⠀⠀⠀⢰⣿⣿⡄")
    print("⠀⠀⠀⠀⠀⠀⢀⠀⡄⢀⢠⣿⡄⢠⣴⣿⣿⣿⣿⣤⡀⠀⢸⠉⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⠃⠀⠀⣼⣿⣿⣿⡄⠀⢀⣠⣿⣿⣿⣷⣀⡀")
    print("⠀⠀⠀⠀⢸⣦⣿⣴⣷⣼⣿⣿⣿⡄⢹⣿⡿⠿⣿⡏⠀⢠⣿⣇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣼⣧⠀⠀⠻⣿⣿⣿⣿⣿⠛⠈⢻⣿⣿⣿⣿⡟⠁")
    print("⠀⠀⠀⠀⠀⢹⣿⣿⣿⣿⣿⣿⣿⣿⣾⣿⡇⢸⣿⡇⢀⣾⣿⣿⣆⠀⠀⠀⠀⠀⠀⠀⠀⠀⣸⣿⣿⣇⠀⠀⣿⡯⠡⣿⣿⠀⠀⢸⣿⡇⢸⣿⡇")
    print("⠀⠀⠀⠀⠀⢸⡏⡛⣿⣿⣿⠻⢻⣿⢸⣿⡇⢸⣿⡷⣾⣿⣿⣿⣿⡶⠄⠀⠀⠀⠀⠀⢠⣴⣿⣿⣿⣿⣦⣤⣿⣷⣶⣿⣿⠀⠀⢸⣿⣿⣿⣿⡇")
    print("⠀⠀⠀⠀⠀⢸⣧⣦⣿⣿⣿⠬⢸⣿⢸⣿⡇⠒⣿⡇⢹⣿⠋⣹⣿⡇⠀⠀⠀⠀⠀⠀⠀⢹⣿⡿⡻⣿⡏⣦⣿⣿⣿⣿⣿⣴⠀⢸⣿⣿⣿⣿⡇")
    print("⠀⠐⢶⣾⣿⣿⣿⣿⣿⣿⣿⠒⢸⣿⢸⣿⣁⣈⣿⡇⢸⣿⣤⣼⣿⣿⣿⣿⣿⣷⡶⠂⠀⢸⣿⣇⣁⣿⡇⠙⣿⣿⣿⣿⣿⠋⠰⣾⣿⣿⣿⣿⡷⠆")
    print("⠀⠀⠀⣿⣿⡟⠿⣿⣿⣿⣿⣿⣿⣿⣾⣿⣿⣿⣿⣷⣼⣿⣿⣿⣿⣿⡿⢿⣿⣿⣤⣤⣠⣼⣿⣿⣿⣿⣷⣶⣿⣿⣿⣿⣿⣠⣤⣼⣿⣿⠿⢻⡇")
    print("⠀⠀⠀⣿⣿⣯⣀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠐⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⢿⣀⣹⡇")
    print("⠀⠀⠀⣷⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠿⢿⣿⣿⣿⣿⣿⣿⣿⣿⣤⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠂⢸⣿⣿⡇")
    print("⠀⠀⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡟⡂⠀⠐⢻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇")
    print("⠀⠀⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇⠄⠀⠠⢼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇")
    print("   ⠛⠻⠿⠛⠛⠛⠛⠛⠻⠿⠿⠇⠁⠀⠈⠼⠿⠿⠟⠛⠛⠛⠛⠛⠿⠛⠛⠛⠛⠛⠻⠿⠿⠿⠿⠿⠿⠿⠿⠿⠿⠟⠛⠛⠛⠛⠿⠿⠛⠃")
    print()
    print("신입생 여러분! 호그와트에 오신것을 환영합니다.")
    time.sleep(1.0)
    while True:
        print()
        q=input("[기숙사 배정을 받으러 가시겠습니까?(yes or no)]: ")
        print()
        if q=="yes":
            print("무슨 기숙사를 배정받을지 아주 궁금하네요!")
            break
        elif q=="no":
            print("후후후...\n들어올때 마음대로 들어와도 나갈때는 마음대로 못나간답니다!")
        else:
            print("너무 긴장하셨나...잘 못들었는데 다시 한번 말씀해 주시겠어요?") 
    print()
    time.sleep(1.0)
    print("오! 저기 마법의 모자가 있네요!")
    time.sleep(1.5)
    os.system("cls")

    print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣴⣦⣄⡀")
    print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣴⣿⣿⣿⣿⣿⣦⡀")
    print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣿⣿⣿⣿⠃⠀⠈⠹⣿⡆")
    print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣾⣿⣿⣿⣿⠃⣼⣃⣀⣸⣿⠁")
    print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣴⣿⣿⣿⣿⣿⡏⠀⠉⠛⠻⠿⠁")
    print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣰⣿⣿⣿⣿⣿⣿⣿⠁")
    print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢰⣿⣿⣿⣿⣿⣿⣿⣿⣄")
    print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣉⣿⣿⣿⣿⣿⣿⣿⣿⣿⣶")
    print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢰⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣆")
    print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣟⡻⠿⣆")
    print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣯⣽⣷⣶⢸⣿⣆")
    print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⢸⣿⣿⡆")
    print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣀⣠⣤⣤⣤⣴⣶⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣾⣿⣿⣶⣶⣤⣄⣀")
    print("⠀⠀⠀⠀⠀⠀⠀⢀⣴⣶⣶⣯⣿⡻⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⣿⣿⣿⣿⣿⣶⣄")
    print("⠀⠀⠀⠀⠀⠀⠀⠸⢿⣿⣿⣿⣿⣿⠷⠮⠛⠿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠛⠉⠁⠙⠻⠿⣿⣿⣿⣿⣿⣷")
    print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠛⠻⠿⣿⣿⣿⣿⣿⣿⣿⠿⠟⠛⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠉⠉⠉⠁")
    print()
    print("무척 낡고 더러워 보이지만...")
    time.sleep(1.0)
    print("4대 창시자들의 마법이 들어있는 세상에 하나밖에 없는 모자랍니다!")
    time.sleep(1.5)
    print()
    print("자...이제 마법의 모자를 써 보도록 할께요!")
    print()
    while True:
        hat=input("[마법의 모자를 쓰시겠습니까?]: ")
        print()
        if hat=="yes":
            print("탁월한 선택이네요!")
            break
        elif hat=="no":
            print("거절은 거절하겠습니다. 안쓰시겠다면 강제로 씌워드릴 수밖에...")
            print()
        else:
            print("잘 안들리는데, 다시 한번 말씀해 주시겠어요?")
            print()
    time.sleep(1.0)
    os.system("cls")
    print("이제 눈을 감고 숫자를 카운트다운하겠습니다.")
    time.sleep(0.8)
    print(5)
    time.sleep(0.8)
    print(4)
    time.sleep(0.8)
    print(3)
    time.sleep(0.8)
    print(2)
    time.sleep(0.8)
    print(1)
    time.sleep(0.8)
    os.system("cls")

    print()
    print("⠀⠀⠀⠀⠀⠀⠀⠀⢀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀")
    print("⠀⠀⠀⠀⠀⠀⠀⢀⣾⣿⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣰⣿⣦")
    print("⠀⠀⠀⠀⠀⠀⢠⣾⣿⣿⣿⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣼⣿⣿⣿⣧")
    print("⠀⠀⠀⠀⠀⢠⣿⣿⣿⣿⣿⣿⣆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣼⣿⣿⣿⣿⣿⣧⡀")
    print("⠀⠀⠀⠀⣠⣿⣿⣿⣿⣿⣿⣿⣿⣆⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣾⣿⣿⣿⣿⣿⣿⣿⣷⡀")
    print("⠀⠀⠀⠀⠀⠈⠉⠉⠉⠉⠉⠉⠉⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠉⠉⠉⠉⠉⠉⠉⠉")
    print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣰⣷⡀")
    print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣰⣿⣿⣿⡄")
    print("⠀⠀⠀⠀⣧⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣰⣿⣿⣿⣿⣿⣆⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣴")
    print("⠀⠀⠀⠀⠘⣷⡀⠀⡀⠀⠀⠀⠀⠀⠀⠀⠛⠛⠛⠛⠛⠛⠛⠀⠀⠀⠀⠀⠀⠀⠀⢀⣾⠃")
    print("⠀⠀⠀⠀⠀⠹⣷⣾⣿⣦⡀⠀⠀⠀⣀⡀⠀⠀⠀⠀⠀⢀⡀⠀⠀⠀⠀⢀⣴⣿⣷⣿⠏")
    print("⠀⠀⠀⠀⠀⠀⠹⠋⠙⢿⣿⣶⣾⣿⣿⣿⣦⣄⢀⣠⣶⣿⣿⣶⣄⣠⣶⣿⡿⠻⡿⠋")
    print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠻⣿⡿⠟⠛⢿⣿⣿⣿⣿⣿⠟⠛⢿⣿⣿⡿⠋")
    print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠛⠟⠋⠀⠀⠀⠀⠈⠉")
    print()
    time.sleep(1.0)
    print("오...너가 2022년도 새로운 신입생이로구나.")
    time.sleep(1.0)
    print("나는 너를 기숙사로 배정해줄 마법의 모자란다! 너의 정신과 잠시 연결되어 있는 것이니 너무 놀라지 말거라.")
    time.sleep(2.0)
    first=input("몇가지 질문을 할테니, 질문에 yes or no로 답해다오. 알겠니?: ")
    while True:
        if first=='yes':
            print()
            print("허허..그래 착하구나.")
            break
        elif first=='no':
            print()
            print("후후...모자를 쓴이상 답변 할수 밖에 없을게다...")
            break
        else:
            print()
            first=input("음...yes or no로 답변해다오. 알겠니?")
    time.sleep(2.0)
    os.system("cls")

    brave=0
    smart=0
    cunning=0
    kind=0
    print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣾⡀⠀⠀⠀⠀⠀⠀⠀⠀⡄")
    print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⣾⣿⡇⠀⠀⠀⠀⠀⠀⠀⣸⡇")
    print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⣿⣿⣿⡇⠀⠀⠀⠀⠀⠀⢰⣿⣿⠀")
    print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⣰⣿⣿⣿⣿⡇⠀⠀⠀⠀⠀⢠⣿⣿⣿⡀")
    print("⠀⠀⠀⠀⠀⠀⠀⠀⢴⣿⣿⣿⣿⣿⡇⠀⠀⠀⠀⢀⣾⣿⣿⣿⡇")
    print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠁⠀⠀⠀⠀⠸⠿⠿⢿⣿⣇")
    print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀")
    print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣿⡆")
    print("⠀⠀⠀⢄⠀⠀⠀⠀⠀⠀⠀⠀⠀⣰⣿⣿⣷")
    print("⠀⠀⠀⠈⢿⣦⣄⡀⠀⠀⠀⠀⠀⠀⠉⠉⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣠⣶⠟")
    print("⠀⠀⠀⠀⠈⢿⣿⣿⣷⡆⠀⠀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⠀⠀⠀⣶⣿⣿⣿⠏")
    print("⠀⠀⠀⠀⠀⠈⢿⣿⣿⣦⣤⣼⣿⣿⣶⣶⣦⣤⣶⣶⣾⣿⣿⣧⣴⣾⣿⣿⡿⠃")
    print("⠀⠀⠀⠀⠀⠀⠀⠈⠻⣿⣿⡿⠙⢻⣿⣿⣿⣿⣿⣿⣿⠿⠛⢿⣿⡿⠟⠁")
    print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠀⠠⢿⣿⣿⣿⣿⣿⣿⡷⠀⠀⠈⠉")
    print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉")
    print()
    q1=input("첫번째 질문은 간단하단다.\n너도 알다시피 마법의 세계에는 마법사들 외에도 수많은 다른 생명체들이 있단다.\n집요정, 늑대인가, 거인족, 고블린 등등... \n너는 이들과도 친구가 될 수 있다고 생각하느냐?: ")
    while True:
        if q1=='yes':
            kind+=23
            brave+=15
            smart+=10
            cunning+=2
            print()
            print("오호..열린 마음을 가지고 있는 아이로군.")
            break
        elif q1=='no':
            cunning+=22
            smart+=10
            kind-=8
            brave-=3
            print()
            print("음...익숙하지 않은 만남은 무서울 수도 있지..")
            break
        else:
            print()
            q1=input("음? 잘 안들리는구나, 다시 한번 말해주겠느냐?: ")

    time.sleep(1.0)
    os.system("cls")
    print()
    print()
    print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀")
    print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣤⣾⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⢰⣿⣷⣦⡀")
    print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣴⣿⣿⣿⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⣿⣿⣿⣿⣿⣷⣄")
    print("⠀⠀⠀⠀⠀⠀⠀⣠⣾⣿⣿⣿⣿⣿⣿⣿⣿⠀⠀⠀⠀⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣷⣦⡀")
    print("⠀⠀⠀⠀⠀⣠⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠀⠀⠀⠀⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣦")
    print("⠀⠀⠀⢀⣼⣿⣿⣿⡿⠿⠿⠿⠿⠿⠿⠿⣿⠀⠀⠀⠀⠀⠀⢸⣿⡿⠿⠿⠿⠿⣿⣿⣿⣿⣿⣷⣄")
    print("⠀⠀⠀⠉⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠉⠉⠃")
    print("⠀⠀⠀⠀⠀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀")
    print("⠀⠀⠀⠀⠀⢻⣷⣤⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣤⣶⡿")
    print("⠀⠀⠀⠀⠀⠈⣿⣿⣿⣿⣧⡀⠀⣀⣤⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣶⣿⣿⣿⣿⠃")
    print("⠀⠀⠀⠀⠀⠀⠈⢿⣿⣿⣿⣿⣿⣿⣿⣿⣷⣦⣄⣀⣤⣾⣿⣷⣶⣤⣴⣾⣿⣿⣿⣿⡿⠃")
    print("⠀⠀⠀⠀⠀⠀⠀⠀⠙⠿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠿⣿⡿⠋")
    print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠙⠛⠟⠀⠈⠙⠻⠿⠟⠉⠀⠈⠙⠻⠟⠉")
    print()
    q2=input("자...다음 질문이다\n아는지 모르겠지만, 호그와트성 뒷편에는 금지된 숲이 있단다.\n아주 위험한 동 식물들이 살고 있기도 하지만 아름다운 유니콘이 살고 있는 집이기도 하지.\n만약 금지된 숲에 갈 기회가 있다면 가겠느냐?: ")
    while True:
        if q2=='yes':
            brave+=22
            smart+=15
            cunning-=4
            print()
            print("허허 용감한 아이로구나!")
            break
        elif q2=='no':
            cunning+=20
            smart+=15
            kind+=10
            brave-=7
            print()
            print("그래, 위험한 곳은 조심하는 것이 좋지..")
            break
        else:
            print()
            q2=input("음? 잘 안들리는구나, 다시 한번 말해주겠느냐?: ")


    time.sleep(1.0)
    os.system("cls")

    print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣾⡀⠀⠀⠀⠀⠀⠀⠀⠀⡄")
    print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⣾⣿⡇⠀⠀⠀⠀⠀⠀⠀⣸⡇")
    print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⣿⣿⣿⡇⠀⠀⠀⠀⠀⠀⢰⣿⣿⠀")
    print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⣰⣿⣿⣿⣿⡇⠀⠀⠀⠀⠀⢠⣿⣿⣿⡀")
    print("⠀⠀⠀⠀⠀⠀⠀⠀⢴⣿⣿⣿⣿⣿⡇⠀⠀⠀⠀⢀⣾⣿⣿⣿⡇")
    print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠁⠀⠀⠀⠀⠸⠿⠿⢿⣿⣇")
    print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀")
    print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣿⡆")
    print("⠀⠀⠀⢄⠀⠀⠀⠀⠀⠀⠀⠀⠀⣰⣿⣿⣷")
    print("⠀⠀⠀⠈⢿⣦⣄⡀⠀⠀⠀⠀⠀⠀⠉⠉⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣠⣶⠟")
    print("⠀⠀⠀⠀⠈⢿⣿⣿⣷⡆⠀⠀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⠀⠀⠀⣶⣿⣿⣿⠏")
    print("⠀⠀⠀⠀⠀⠈⢿⣿⣿⣦⣤⣼⣿⣿⣶⣶⣦⣤⣶⣶⣾⣿⣿⣧⣴⣾⣿⣿⡿⠃")
    print("⠀⠀⠀⠀⠀⠀⠀⠈⠻⣿⣿⡿⠙⢻⣿⣿⣿⣿⣿⣿⣿⠿⠛⢿⣿⡿⠟⠁")
    print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠀⠠⢿⣿⣿⣿⣿⣿⣿⡷⠀⠀⠈⠉")
    print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉")
    print()
    q3=input("또한 마법 세계에는 아주 위험한 마법들도 많단다.\n바로 어둠의 마법같은 것들이지!\n하지만 대의를 위해 어둠의 마법이 필요하다고 한다면, 어둠의 마법을 배우겠느냐?: ")
    while True:
        if q3=='yes':
            cunning+=26
            brave+=10
            smart+=10
            kind-=5
            print()
            print("생각보다 과격하구나...")
            break
        elif q3=='no':
            smart+=11
            kind+=10
            brave+=10
            cunning-=16
            print()
            print("어둠의 마법은 무척이나 위험하지...")  
            break     
        else:
            print()
            q3=input("음? 잘 안들리는구나, 다시 한번 말해주겠느냐?: ")


    time.sleep(1.5)
    os.system("cls")
    print()
    print()
    print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀")
    print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣤⣾⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⢰⣿⣷⣦⡀")
    print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣴⣿⣿⣿⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⣿⣿⣿⣿⣿⣷⣄")
    print("⠀⠀⠀⠀⠀⠀⠀⣠⣾⣿⣿⣿⣿⣿⣿⣿⣿⠀⠀⠀⠀⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣷⣦⡀")
    print("⠀⠀⠀⠀⠀⣠⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠀⠀⠀⠀⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣦")
    print("⠀⠀⠀⢀⣼⣿⣿⣿⡿⠿⠿⠿⠿⠿⠿⠿⣿⠀⠀⠀⠀⠀⠀⢸⣿⡿⠿⠿⠿⠿⣿⣿⣿⣿⣿⣷⣄")
    print("⠀⠀⠀⠉⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠉⠉⠃")
    print("⠀⠀⠀⠀⠀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀")
    print("⠀⠀⠀⠀⠀⢻⣷⣤⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣤⣶⡿")
    print("⠀⠀⠀⠀⠀⠈⣿⣿⣿⣿⣧⡀⠀⣀⣤⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣶⣿⣿⣿⣿⠃")
    print("⠀⠀⠀⠀⠀⠀⠈⢿⣿⣿⣿⣿⣿⣿⣿⣿⣷⣦⣄⣀⣤⣾⣿⣷⣶⣤⣴⣾⣿⣿⣿⣿⡿⠃")
    print("⠀⠀⠀⠀⠀⠀⠀⠀⠙⠿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠿⣿⡿⠋")
    print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠙⠛⠟⠀⠈⠙⠻⠿⠟⠉⠀⠈⠙⠻⠟⠉")
    print()
    q4=input("마법사에게 지식이란 황금과도 같지! 책을 좋아하는 걸로 보이지는 않지만...\n호그와트에 오기 전에 교과서는 읽어봤느냐?: ")
    while True:
        if q4=='yes':
            smart+=27
            kind+=10
            cunning+=9
            print()
            print("성실한 아이로구나.")
            break
        elif q4=='no':
            brave+=9
            kind+=8
            smart-=24
            print()
            print("허허.. 마법사들은 다들 게으른 법이지...")       
            break
        else:
            print()
            q4=input("음? 잘 안들리는구나, 다시 한번 말해주겠느냐?: ")
    time.sleep(1.0)
    os.system("cls")

    print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣾⡀⠀⠀⠀⠀⠀⠀⠀⠀⡄")
    print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⣾⣿⡇⠀⠀⠀⠀⠀⠀⠀⣸⡇")
    print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⣿⣿⣿⡇⠀⠀⠀⠀⠀⠀⢰⣿⣿⠀")
    print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⣰⣿⣿⣿⣿⡇⠀⠀⠀⠀⠀⢠⣿⣿⣿⡀")
    print("⠀⠀⠀⠀⠀⠀⠀⠀⢴⣿⣿⣿⣿⣿⡇⠀⠀⠀⠀⢀⣾⣿⣿⣿⡇")
    print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠁⠀⠀⠀⠀⠸⠿⠿⢿⣿⣇")
    print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀")
    print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣿⡆")
    print("⠀⠀⠀⢄⠀⠀⠀⠀⠀⠀⠀⠀⠀⣰⣿⣿⣷")
    print("⠀⠀⠀⠈⢿⣦⣄⡀⠀⠀⠀⠀⠀⠀⠉⠉⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣠⣶⠟")
    print("⠀⠀⠀⠀⠈⢿⣿⣿⣷⡆⠀⠀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⠀⠀⠀⣶⣿⣿⣿⠏")
    print("⠀⠀⠀⠀⠀⠈⢿⣿⣿⣦⣤⣼⣿⣿⣶⣶⣦⣤⣶⣶⣾⣿⣿⣧⣴⣾⣿⣿⡿⠃")
    print("⠀⠀⠀⠀⠀⠀⠀⠈⠻⣿⣿⡿⠙⢻⣿⣿⣿⣿⣿⣿⣿⠿⠛⢿⣿⡿⠟⠁")
    print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠀⠠⢿⣿⣿⣿⣿⣿⣿⡷⠀⠀⠈⠉")
    print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉")
    print()
    q5=input("마지막 질문이다.\n어떤 마법사는 모든 마법중에 가장 강력한 것은 사랑이라 했었지...\n너도 그 말에 동의 하느냐?: ")
    while True:
        if q5=='yes':
            kind+=29
            brave+=20
            smart+=10
            cunning-=10
            print()
            print("덤블도어 같은 놈이 또 하나 있다니...")
            break
        elif q5=='no':
            smart+=18
            cunning+=10
            kind-=14
            print()
            print("음...매우 현실적인 아이로구나...")   
            break    
        else:
            print()
            q5=input("음? 잘 안들리는구나, 다시 한번 말해주겠느냐?: ")
    time.sleep(1.0)
    os.system("cls")

    print()
    print("⠀⠀⠀⠀⠀⠀⠀⠀⢀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀")
    print("⠀⠀⠀⠀⠀⠀⠀⢀⣾⣿⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣰⣿⣦")
    print("⠀⠀⠀⠀⠀⠀⢠⣾⣿⣿⣿⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣼⣿⣿⣿⣧")
    print("⠀⠀⠀⠀⠀⢠⣿⣿⣿⣿⣿⣿⣆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣼⣿⣿⣿⣿⣿⣧⡀")
    print("⠀⠀⠀⠀⣠⣿⣿⣿⣿⣿⣿⣿⣿⣆⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣾⣿⣿⣿⣿⣿⣿⣿⣷⡀")
    print("⠀⠀⠀⠀⠀⠈⠉⠉⠉⠉⠉⠉⠉⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠉⠉⠉⠉⠉⠉⠉⠉")
    print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣰⣷⡀")
    print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣰⣿⣿⣿⡄")
    print("⠀⠀⠀⠀⣧⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣰⣿⣿⣿⣿⣿⣆⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣴")
    print("⠀⠀⠀⠀⠘⣷⡀⠀⡀⠀⠀⠀⠀⠀⠀⠀⠛⠛⠛⠛⠛⠛⠛⠀⠀⠀⠀⠀⠀⠀⠀⢀⣾⠃")
    print("⠀⠀⠀⠀⠀⠹⣷⣾⣿⣦⡀⠀⠀⠀⣀⡀⠀⠀⠀⠀⠀⢀⡀⠀⠀⠀⠀⢀⣴⣿⣷⣿⠏")
    print("⠀⠀⠀⠀⠀⠀⠹⠋⠙⢿⣿⣶⣾⣿⣿⣿⣦⣄⢀⣠⣶⣿⣿⣶⣄⣠⣶⣿⡿⠻⡿⠋")
    print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠻⣿⡿⠟⠛⢿⣿⣿⣿⣿⣿⠟⠛⢿⣿⣿⡿⠋")
    print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠛⠟⠋⠀⠀⠀⠀⠈⠉")
    print()
    q6=input("자, 너가 어디로 갈지 정해졌구나! 기숙사배정을 받겠느냐?: ")
    while True:
        if q6=="yes":
            time.sleep(1.0)
            os.system("cls")
            if brave>smart and brave>cunning and brave>kind:
                print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⣾⡟⣱⣾⣿⠿⠓⠂")
                print("⠀⠀⠀⠀⠀⠀⣄⢰⣾⠸⣿⡰⠿⠫⠥⣶⣶⣾⣿⣿⣶⣦⣄⡀")
                print("⠀⠀⠀⠀⠀⠘⢿⡦⣙⣂⠙⢠⠛⢿⣦⠈⠉⣉⣀⣀⣉⡉⠙⠳⠄")
                print("⠀⠀⠀⠀⠀⢀⣴⣿⣿⠟⠁⠀⠀⢸⣿⠀⢷⣶⣯⣽⣻⠿⣿⣶⣦⣀")
                print("⠀⠀⠀⠀⠀⣚⣿⣿⣿⣦⠀⠀⠠⠾⠃⠀⣠⣬⣻⣿⣿⣿⣶⣝⠻⣿⣷⡄")
                print("⠀⠀⢀⣴⣌⢛⣭⣿⣭⣥⣶⣿⣦⡄⠀⠀⠈⠻⣿⣿⣿⣿⣿⣿⣷⣄⠙⢿⡄")
                print("⢀⣶⣿⣿⣿⣿⣿⣿⡿⠛⠉⠙⢿⡇⠀⡀⠲⣄⠙⣿⣿⣿⣿⣿⣿⣿⣦⠀⠁")
                print("⢿⣻⢏⣿⣿⣿⣷⣦⣶⣿⣷⡀⠸⣇⠀⢱⡀⠹⣷⣻⣿⣿⣿⣿⣿⣿⣿⣆")
                print("⠀⠹⣿⣿⣿⣿⠟⠙⠻⢿⣿⡇⠀⠀⠀⠸⣷⠀⢻⣿⣿⣧⠙⣿⣿⣿⣿⣿⣆")
                print("⠀⢰⣶⣦⣝⣿⡀⠀⠀⣸⠟⠀⢀⣴⠀⠀⣿⣇⠸⣿⣿⣿⡆⠘⣿⣿⣿⣿⣿⣦⡀")
                print("⠀⠀⠻⠛⠘⠛⠁⠀⠀⢀⠀⣶⣿⣿⡄⢀⣿⣿⡀⣿⣿⣿⣧⠀⢸⣿⣿⣿⠛⠿⠿⠖")
                print("⠀⠀⠀⠀⠀⠀⠀⣀⣴⣿⠀⣿⣿⣿⠁⢸⣿⣿⡇⣿⣿⣿⣿⠀⢸⣿⣿⠇")
                print("⠀⠀⠀⠀⠀⠈⢙⣿⣿⣿⠀⣿⣿⣿⠀⣾⣿⣿⡇⢻⣿⣿⡿⠀⢸⡿⠃")
                print("⠀⠰⣶⣶⣶⣾⣿⣿⣿⣿⢰⣿⣿⠇⢰⣿⣿⣿⠀⢸⣿⣿⠃⠀⠈")
                print("⠀⠀⠀⣸⣿⣿⢋⣿⣿⡟⣼⣿⡟⠀⣾⣿⣿⠃⠀⣼⡿⠃")
                print("⠀⠀⠀⣿⣿⠇⢸⣿⣿⢃⣿⣿⠀⠀⣿⣿⡏⠀⠀⠋")
                print("⠀⠀⠀⣿⣿⠀⢸⣿⡟⢸⣿⣿⠀⠀⣿⣿⠁")
                print("⠀⠀⠀⢻⣿⡄⠸⣿⣇⠀⣿⣿⡀⠀⠹⣿")
                print("⠀⠀⠀⠈⢻⣷⡀⠹⣿⡀⠘⢿⣷⣄⠀⠙⠦⡀")
                print("⠀⠀⠀⠀⠀⠙⢷⣄⠙⢷⣄⠀⠈⠙⠓⠤")
                print("⠀⠀⠀⠀⠀⠀⠀⠈⠂⠀⠉⠓⠤⢀")
                print("-"*70)
                print("당신은 용감한 사자! 그리핀도르로 배정받았습니다!")
                print("용기,용맹,기사도 정신을 중요시 여기는 당신은 그리핀도르에서 멋진 친구들을 만날거예요!")
                print("활동성이 넘치는 그대에게 퀴디치를 추천합니다!\n용기:{} 야망:{} 지식:{} 상냥함:{}".format(brave,cunning,smart,kind))
                break       
            elif cunning>smart and cunning>brave and cunning>kind:
                print("⠀⠀⠀⠀⠀⠀⠀⠀⢀⣀⣤⣤⣤⣤⣤⣀")
                print("⠀⠀⠀⠀⠀⠀⣰⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣦⡀⠀⠀⠀⠀⢀")
                print("⠀⠀⠀⠀⢀⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣧⠀⠀⠀⣠⠇")
                print("⠀⠀⠀⠀⣼⣿⣿⣿⣧⣿⠿⠛⠈⠹⣿⣿⣿⣿⣿⠀⠀⣴⣿")
                print("⠀⠀⠀⠸⣿⣿⣿⣿⠟⡠⠀⠀⠀⢀⣿⣿⣿⣿⣿⠀⢸⣿⣿⡄")
                print("⠀⠀⠀⠀⠀⠀⠐⠧⠚⠁⠀⠀⢀⣾⣿⣿⣿⣿⠇⠀⠈⢿⣿⣿⡀")
                print("⠀⠀⠀⠀⠀⠀⠁⠀⠀⠀⠀⣠⣾⣿⣿⣿⣿⠏⠀⠀⠀⠈⢿⣿⣷⡄")
                print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣴⣿⣿⣿⣿⣿⠏⠀⠀⠀⠀⠀⠈⢻⣿⣿⣆")
                print("⠀⠀⠀⠀⠀⠀⠀⠀⢀⣾⣿⣿⣿⣿⡿⠁⠀⣀⣠⣤⣴⣶⣦⣄⣿⣿⣿⣇")
                print("⠀⠀⠀⠀⠀⠀⠀⢠⣿⣿⣿⣿⣿⠏⣠⣾⣿⣿⣿⣿⣿⣿⣿⣿⢹⣿⣿⣿⡄")
                print("⠀⠀⠀⠀⠀⠀⣰⣿⣿⣿⣿⡿⠁⣼⣿⣿⣿⣿⠟⠛⠛⠿⣿⣿⣾⣿⣿⣿⢇")
                print("⠀⠀⠀⠀⠀⢠⣿⣿⣿⣿⡿⠁⠀⣿⣿⣿⣿⣅⠀⠀⠀⣀⣤⣾⣿⣿⣿⢯⣾⣆")
                print("⠀⠀⠀⠀⠀⣿⣿⣿⣿⣿⠃⠀⠀⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⣹⣿⣿⣿")
                print("⠀⠀⠀⠀⢸⣿⣿⣿⣿⣿⠀⠀⠀⠀⠙⢿⣿⣿⣿⣿⣿⣿⠿⠛⠁⣾⣿⣿⣿⡿")
                print("⠀⠀⠀⠀⠈⣿⣿⣿⣿⣿⣧⠀⠀⠀⠀⠀⠀⠉⠉⠉⠉⠀⠀⠀⣼⣿⣿⣿⣿⠇")
                print("⠀⠀⠀⠀⠀⠹⣿⣿⣿⣿⣿⣧⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣾⣿⣿⣿⣿⠋")
                print("⠀⠀⠀⠀⠀⠀⠻⣿⣿⣿⣿⣿⣿⣶⣤⣀⡀⠀⣀⣠⣴⣾⣿⣿⣿⣿⡿⠃")
                print("⠀⠀⠀⠀⠀⠀⠀⠙⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠋")
                print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠛⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠛⠉")
                print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠉⠉⠉⠉⠉⠁")
                print("-"*70)
                print("당신은 야심찬 뱀! 슬리데린으로 배정받았습니다!")
                print("야망과 영리한 당신은 이곳에서 많은 것을 배우고 얻을 것입니다.")
                print("이왕 슬리데린에 온거 세계정복을 노려보는 것은 어떤가요?\n용기:{} 야망:{} 지식:{} 상냥함:{}".format(brave,cunning,smart,kind))
                break           
            elif kind>smart and kind>brave and kind>cunning:
                print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⢶⣻⣿⣿⣿⣿⣶⣤⣀")
                print("⢶⣶⣦⡀⠀⠀⠀⠀⠀⠀⢰⡿⣿⡟⠋⠙⠻⣛⠿⠿⢿⣿⣿⣷⣶⣶⣶⣶")
                print("⠐⣿⣿⣿⣆⠀⠀⠀⠀⢠⡟⠉⢻⣤⣤⣤⣴⣿⣧⣴⣶⣶⣶⣿⣿⡿⣿⠃")
                print("⠀⠸⣿⣿⣿⣆⠀⠀⠀⣸⠀⠀⣾⣿⣿⣿⣿⣿⣿⣿⣯⣿⣿⠷⠶⠾⠋")
                print("⠀⠀⢿⣿⣿⡿⣷⣄⣰⠁⠀⢠⣿⡿⣿⡿⣿⣿⣿⡿⠋⠈")
                print("⠀⠀⠀⢿⣿⣷⡄⢉⡏⠀⢰⣿⣿⣿⣿⣿⣿⣿⣿⣷⣦⡀")
                print("⠀⠀⠀⠸⣿⣿⠀⢸⡇⠀⢸⣿⣿⣿⣿⣿⢿⣿⣿⣿⣿⣿⠛⢶⣄⡀")
                print("⠀⠀⠀⠀⠙⢿⣷⣼⣧⡇⣾⣿⣿⣿⢿⣿⣷⣽⣿⣿⣷⣿⣿⣶⣍⡛⢶⣄")
                print("⠀⠀⠀⠀⠀⠀⠙⠻⣿⣷⣿⣹⣿⣿⣾⣿⣿⣿⣿⣿⣿⢿⣿⣿⣿⣧⡀⠙⢿⣦")
                print("⠀⠀⠀⠀⠀⠀⠀⠀⣠⣿⡿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⣿⣿⣿⣿⣦⣄⠀⢿⣷⡄")
                print("⠀⠀⠀⠀⠀⠀⣠⣾⣟⣿⣿⣿⣿⣿⣿⣿⣿⣿⣛⣿⣿⣿⣿⣿⣿⣿⣿⣿⣅⠀⢹⣿⣆")
                print("⠀⠀⠀⠀⣀⣼⣿⣿⣿⣿⣿⣿⣵⠿⠿⠿⠿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⡀⣿⣿⡄")
                print("⠀⠀⠀⣾⡟⣉⣭⣿⣿⠿⠛⠉⠀⠀⠀⠀⠀⠈⣿⠾⣿⣟⣿⣿⣿⣿⣿⣿⣿⣿⣧⢸⣿⡇")
                print("⠀⠀⠘⡿⡿⠟⠛⠉⠀⠀⠀⠀⠀⠀⠀⠀⢀⣾⡃⠀⢻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣼⣿⣿")
                print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣴⣾⣷⣶⣦⣴⣿⣿⣿⡀⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⢿⡏")
                print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⠛⠿⣿⣿⣿⣿⣿⣿⣿⠀⢿⣿⣿⣿⣿⣸⣿⣿⣿⣿⣿⣸⡇")
                print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠙⠛⠛⠛⠛⠛⠛⢻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⡀")
                print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣠⣴⣿⣿⣿⣿⣿⣿⣿⠟⠙⠿⠿⣿⣷")
                print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⣾⣿⣿⣿⣿⣿⣿⣿⠟⠋⠀⠀⠀⠀⠀⠀⠈")
                print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠿⡿⠿⠿⠿⠟⠋⠁")
                print("-"*70)
                print("당신은 상냥한 오소리! 후플푸프로 배정받았습니다!")
                print("정의롭고 성실한 당신은 이곳에서 진정한 친구를 만날거예요")
                print("모든 기숙사 사람들을 친구로 만들어 보는 것은 어떤가요?\n용기:{} 야망:{} 지식:{} 상냥함:{}".format(brave,cunning,smart,kind))
                break
            elif smart>kind and smart>brave and smart>cunning:
                print("⠀⠀⠀⣦⣀⠀⣄⡀")
                print("⠀⠀⠱⣾⣿⣷⣾⣿⣦⡄⢀⡀")
                print("⠀⠰⢦⣬⣿⣿⣿⣿⣿⣿⣶⣿⣦⡀")
                print("⠀⠀⠐⢾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⣄")
                print("⠀⠀⠀⠀⠙⠿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⡀")
                print("⠀⠀⠀⠀⠀⠀⠘⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣦⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣀⣀⣴⣾⢏⡄")
                print("⠀⠀⠀⠀⠀⠀⠀⠀⠉⠻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣶⠆⠤⣤⣶⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡋")
                print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⢻⣿⣿⣿⣿⣿⣿⣿⣿⡏⠄⠠⣬⢹⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡟⠋⠁")
                print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠉⠉⣫⣿⣿⣿⣿⣿⣿⡷⠲⣾⢿⣿⣿⣿⣿⣿⣿⡿⠟⠃")
                print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⣶⣶⣾⣷⣾⣿⣿⣿⣿⣿⣿⣿⡟⠃⠀⠋⠀⠀⠉⠉⠛⠋⠙")
                print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⢿⢫⢫⣧⠝⠿⣿⣿⣿⣿⡇")
                print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠹⢿⣿⡿⠷⣄⣴⠶⠂")
                print("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠻⠳⣦⡟⠷⡒")
                print("-"*70)
                print("당신은 똑똑한 독수리! 레번클로로 배정받았습니다!")
                print("현명하고 탐구심이 많은 당신은 걸어다니는 백과사전이네요")
                print("래번클로의 기숙사 마스코트인 독수리와 열띤 토론을 즐겨보세요!\n용기:{} 야망:{} 지식:{} 상냥함:{}".format(brave,cunning,smart,kind))
                break
            else:
                print("모든 기숙사에서 탐내는 인재로구나.\n어느 기숙사를 가도 잘할테니 너에게 선택권을 주마...")
                while True:
                    d=input("그리핀도르, 슬리데린, 후플푸프, 레번클로 중 어디를 가고 싶으냐?: ")
                    if d=="그리핀도르":
                        print("-"*70)
                        print("당신은 용감한 사자! 그리핀도르로 배정받았습니다!")
                        print("용기,용맹,기사도 정신을 중요시 여기는 당신은 그리핀도르에서 멋진 친구들을 만날거예요!")
                        print("활동성이 넘치는 그대에게 퀴디치를 추천합니다!")
                        break
                    elif d=="슬리데린":
                        print("-"*70)
                        print("당신은 야심찬 뱀! 슬리데린으로 배정받았습니다!")
                        print("야망과 영리한 당신은 이곳에서 많은 것을 배우고 얻을 것입니다.")
                        print("이왕 슬리데린에 온거 세계정복을 노려보는 것은 어떤가요?")
                        break
                    elif d=="후플푸프":
                        print("-"*70)
                        print("당신은 상냥한 오소리! 후플푸프로 배정받았습니다!")
                        print("정의롭고 성실한 당신은 이곳에서 진정한 친구를 만날거예요")
                        print("모든 기숙사 사람들을 친구로 만들어 보는 것은 어떤가요?")
                        break
                    elif d=="레번클로":
                        print("-"*70)
                        print("당신은 똑똑한 독수리! 레번클로로 배정받았습니다!")
                        print("현명하고 사려깊은 당신은 걸어다니는 백과사전!")
                        print("래번클로의 기숙사 마스코트인 독수리와 열띤 토론을 즐겨보세요!")
                        break
                    else:
                        print("기숙사는 4개 밖에 없단다, 다시 선택하거라.")                        
                break
        else:
            print()
            print("싫어도 기숙사는 꼭 배정되어야 한단다. 다시 머글들의 세계로 돌아갈 것이 아니라면 말이지...")
            print()
            q6=input("기숙사배정을 받겠느냐?: ")

    print("-"*70)
    print("기숙사가 마음에 들기 바라며, 호그와트에서 즐거운 추억 만드시길 빕니다!")
    print()
    print()
    print()
    print("-*-"*24)
    last=input("다시 play하고 싶으시면 yes, 아니면 no를 입력해주세요: ")
    if last=="no":
        print()
        print("play해주셔서 감사합니다")
        print()
        break
    else:
        print()
        print("처음 play 화면으로 돌아가겠습니다.")
    
    time.sleep(0.8)
    os.system("cls")
   




    